# Ultralytics YOLO AGPL-3.0 License - https://ultralytics.com/license
#
# YOLOv8-seg instance segmentation model with:
# 1) SPDConvDown backbone stages
# 2) SPPFRepLKFull top-level context enhancement
# 3) C2fMDKA sadilation on the three neck outputs before Segment
# 4) P2->P3 detail injection and same-level raw feature reflux refinement

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call this with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, SPDConvDown, [128]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4 raw
  - [-1, 1, SPDConvDown, [256]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8 raw
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16 raw
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPFRepLKFull, [1024, 5, 17, 5, 1.0]] # 9

# YOLOv8 neck + head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 3, C2f, [512]] # 12 top-down P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 3, C2fMDKA, [256, False, 1, 0.5, 3, False, [1, 2, 3]]] # 15 top-down P3
  - [[2, 15], 1, P2P3Fuse, [256]] # 16 inject higher-resolution P2 details into P3
  - [[16, 4], 1, RawRefineFuse, [256]] # 17 same-level raw P3 reflux refinement

  - [-1, 1, Conv, [256, 3, 2]] # 18 downsample to P4
  - [[-1, 12], 1, Concat, [1]] # 19 cat head P4
  - [-1, 3, C2fMDKA, [512, False, 1, 0.5, 3, False, [1, 3, 5]]] # 20 refined P4
  - [[20, 6], 1, RawRefineFuse, [512]] # 21 same-level raw P4 reflux refinement

  - [-1, 1, Conv, [512, 3, 2]] # 22 downsample to P5
  - [[-1, 9], 1, Concat, [1]] # 23 cat head P5
  - [-1, 3, C2fMDKA, [1024, False, 1, 0.5, 3, False, [1, 3, 5]]] # 24 refined P5

  - [[17, 21, 24], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
