# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-seg + SLPALite/MSFEMLite (Scheme A)
# Keep official Segment head/loss/postprocess unchanged.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg-slpa-msfem.yaml' will call this file with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3 backbone output
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4 backbone output
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9-P5 backbone output

  # Scheme A additions (equivalent migration)
  - [4, 1, SLPALite, [256]] # 10 enhanced P3 for neck
  - [6, 1, SLPALite, [512]] # 11 enhanced P4 for neck
  - [9, 1, MSFEMLite, [1024]] # 12 enhanced P5 before neck top-down entry

# YOLOv8 head (official segment head pipeline retained)
head:
  - [12, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 11], 1, Concat, [1]] # 14 cat enhanced backbone P4
  - [-1, 3, C2f, [512]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 10], 1, Concat, [1]] # 17 cat enhanced backbone P3
  - [-1, 3, C2f, [256]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 15], 1, Concat, [1]] # 20 cat head P4
  - [-1, 3, C2f, [512]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 12], 1, Concat, [1]] # 23 cat enhanced P5
  - [-1, 3, C2f, [1024]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Segment, [nc, 32, 256]] # 25 Segment(P3, P4, P5)
