# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-seg + Scheme A:
# 1) single-point SE-CBAMLite at P3
# 2) AFP branch from P2 and fuse back to P3
# 3) single CIE-Pool at key P4->P3 neck fusion point
# 4) keep original 3-scale Segment head

# Parameters
nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4 refined
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8 refined
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16 refined
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 3, C2f, [512]] # 12
  - [-1, 1, CIEPool, [512]] # 13 (single-point context enhancement)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 3, C2f, [256]] # 16
  - [-1, 1, SECBAMLite, [256]] # 17 single-point P3 refinement

  - [2, 1, AFPBlock, [256]] # 18 AFP on shallow P2
  - [[18, 17], 1, P2P3Fuse, [256]] # 19 P2->P3 fusion (output keeps P3 shape)

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 13], 1, Concat, [1]] # 21 cat enhanced P4
  - [-1, 3, C2f, [512]] # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 9], 1, Concat, [1]] # 24 cat head P5
  - [-1, 3, C2f, [1024]] # 25 (P5/32-large)

  - [[19, 22, 25], 1, Segment, [nc, 32, 256]] # Segment(P3_refined, P4, P5)
