# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-seg with lightweight 3-scale BiFPN + Fast Normalized Fusion (P3/P4/P5)
# Task docs: https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# BiFPN config
bifpn_c: 256 # unified BiFPN channels before Segment head
bifpn_n: 1 # number of stacked BiFPN layers

# YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32

# YOLOv8-seg head with BiFPN neck
head:
  - [[4, 6, 9], 1, BiFPNBlock, [bifpn_c, bifpn_n, 1e-4, False]] # 10: [P3_out, P4_out, P5_out]
  - [10, 1, Index, [bifpn_c, 0]] # 11-P3_out
  - [10, 1, Index, [bifpn_c, 1]] # 12-P4_out
  - [10, 1, Index, [bifpn_c, 2]] # 13-P5_out

  - [[11, 12, 13], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
