# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-seg + MCSTA(P3) + P2->P3 fuse + raw-backbone reflux (Scheme A)
# Keep official Segment head (3 inputs: P3/P4/P5), loss, and post-processing unchanged.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone (unchanged)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2/4 raw
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8 raw
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16 raw
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8 neck+head with Scheme A insertions
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 3, C2f, [512]] # 12 top-down P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 3, C2f, [256]] # 15 top-down P3
  - [-1, 1, MCSTA, [256, 4]] # 16 P3 single-point MCSTA
  - [[2, 16], 1, P2P3Fuse, [256]] # 17 inject P2 high-res into P3
  - [[17, 4], 1, RawRefineFuse, [256]] # 18 same-level raw P3 reflux refine

  - [-1, 1, Conv, [256, 3, 2]] # 19 downsample to P4
  - [[-1, 12], 1, Concat, [1]] # 20 cat head P4
  - [-1, 3, C2f, [512]] # 21 P4/16
  - [[21, 6], 1, RawRefineFuse, [512]] # 22 same-level raw P4 reflux refine

  - [-1, 1, Conv, [512, 3, 2]] # 23 downsample to P5
  - [[-1, 9], 1, Concat, [1]] # 24 cat head P5
  - [-1, 3, C2f, [1024]] # 25 P5/32

  - [[18, 22, 25], 1, Segment, [nc, 32, 256]] # 26 Segment(P3, P4, P5)
